
&НаКлиенте
Процедура ЛаРС_СкопироватьВыделенныеПосле(Команда)
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	Для Каждого Эл Из МассивСтрок Цикл
		СкопироватьДок(Эл);		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура СкопироватьДок(ТекДок)
		
	// Т.к. прямую ссылку на сервер не передать, закидываем в структуру (иначе выдаст ошибку)
	СтруктураДанных = Новый Структура("ТекДок", ТекДок); 
	
	// Передаем необходимые параметры и проводим манипуляции с переменной ДанныеФормы на сервере
	СкопироватьОбъектДокументаНаСервере(СтруктураДанных); //   ДанныеФормы,
		
КонецПроцедуры   

&НаСервереБезКонтекста
Процедура СкопироватьОбъектДокументаНаСервере(СтруктураДанных)   //ДанныеФормы,
	
	// Копируем объект на сервере по Ссылке
	Док = СтруктураДанных.ТекДок.Скопировать();
	Док.Дата = КонецМесяца(ТекущаяДата());
	
	// Работаем с объектом (разные манипуляции)
	
	Для Каждого Строка Из Док.Услуги Цикл
		  Строка.Содержание = ""+ Строка.Номенклатура.Наименование + " " + Формат(Док.Дата, "ДФ='MMMM yyyy ''г.'''");
	КонецЦикла;

	Док.Записать();
	
КонецПроцедуры