Процедура ПечатьПриказаОСтимулирующих(ТабДок, Ссылка) Экспорт
   Макет = Документы.НазначениеПлановогоНачисления.ПолучитьМакет("ПФ_MXL_ПриказОСтимулирующих");
   Запрос = Новый Запрос;
   Запрос.Текст = "ВЫБРАТЬ
                  |	НазначениеПлановогоНачисленияСотрудники.Ссылка КАК Ссылка,
                  |	НазначениеПлановогоНачисленияСотрудники.НомерСтроки КАК НомерСтроки,
                  |	НазначениеПлановогоНачисленияСотрудники.Сотрудник КАК Сотрудник,
                  |	НазначениеПлановогоНачисленияСотрудники.ДатаНазначения КАК ДатаНазначения,
                  |	НазначениеПлановогоНачисленияСотрудники.ДатаОкончания КАК ДатаОкончания,
                  |	НазначениеПлановогоНачисленияСотрудники.Размер КАК Размер
				  //|	НазначениеПлановогоНачисленияСотрудники.ИдентификаторСтрокиСотрудника КАК ИдентификаторСтрокиСотрудника,
				  //|	НазначениеПлановогоНачисленияСотрудники.КоэффициентИндексации КАК КоэффициентИндексации
                  |ИЗ
                  |	Документ.НазначениеПлановогоНачисления.Сотрудники КАК НазначениеПлановогоНачисленияСотрудники
                  |ГДЕ
                  |	НазначениеПлановогоНачисленияСотрудники.Ссылка = &Ссылка"; //сам текст запроса нам не принципиален
   Запрос.Параметры.Вставить("Ссылка", Ссылка); //в качестве параметра указываем Ссылку – параметр процедуры
   Выборка = Запрос.Выполнить().Выбрать();

   Шапка = Макет.ПолучитьОбласть("Шапка");
   Шапка.Параметры.Заполнить(Ссылка);
   ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
   ТабДок.Очистить();

   ВставлятьРазделительСтраниц = Ложь;
   Шапка.Параметры.Заполнить(Выборка);
   Шапка.Параметры.Дата = Формат(Ссылка.Дата, "ДЛФ=DD");
   Шапка.Параметры.ОГРН = Ссылка.Организация.ОГРН;
   Шапка.Параметры.ИНН = Ссылка.Организация.ИНН;
   Шапка.Параметры.Организация = Ссылка.Организация.НаименованиеПолное;
   Шапка.Параметры.Номер = Ссылка.Номер;
   Шапка.Параметры.Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, Ссылка.Дата, Истина);
   Шапка.Параметры.Месяц = Формат(Ссылка.Дата, "ДФ='ММММ гггг'");
   
   ТабДок.Вывести(Шапка);
   
   Пока Выборка.Следующий() Цикл
	   ОбластьСтрока.Параметры.Заполнить(Выборка);
	   ТабДок.Вывести(ОбластьСтрока);
   КонецЦикла;
   
   Структура=ЗарплатаКадры.ОтветственныеЛицаОрганизации(Ссылка.Организация,"Руководитель,ДолжностьРуководителя",ТекущаяДата());
   
   Подвал = Макет.ПолучитьОбласть("Подвал");
   Подвал.Параметры.РуководительДолжность = Структура.ДолжностьРуководителя;
   Подвал.Параметры.Руководитель = "" + Структура.Руководитель.Фамилия + " " + Структура.Руководитель.Инициалы;
   
   ТабДок.Вывести(Подвал);
   
   
КонецПроцедуры 
