Процедура Печать(ТабДок, Ссылка) Экспорт
   Макет = Документы.ЛаРС_РеестрОплатыИсков.ПолучитьМакет("ПФ_MXL_РеестрОплатыИсков");
   Запрос = Новый Запрос;
   Запрос.Текст = "ВЫБРАТЬ
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.Ссылка КАК Ссылка,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.НомерСтроки КАК НомерСтроки,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.ФИО КАК ФИО,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.Адрес КАК Адрес,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.СуммаПлатежа КАК СуммаПлатежа,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.ПлатежноеПоручение КАК ПлатежноеПоручение,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.ПериодЗадолженности КАК ПериодЗадолженности
                  |ИЗ
                  |	Документ.ЛаРС_РеестрОплатыИсков.ТаблицаОплат КАК ЛаРС_РеестрОплатыИсковТаблицаОплат
                  |ГДЕ
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.Ссылка = &Ссылка"; //сам текст запроса нам не принципиален
   Запрос.Параметры.Вставить("Ссылка", Ссылка); //в качестве параметра указываем Ссылку – параметр процедуры
   Выборка = Запрос.Выполнить().Выбрать();

   Шапка = Макет.ПолучитьОбласть("Шапка");
   Шапка.Параметры.Заполнить(Ссылка);
   ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
   ТабДок.Очистить();

   ВставлятьРазделительСтраниц = Ложь;
   Шапка.Параметры.Заполнить(Выборка);
   ТабДок.Вывести(Шапка);
   
   ИтогоСуммаПлатежа = 0;
   Пока Выборка.Следующий() Цикл
	   //Если ВставлятьРазделительСтраниц Тогда
	   //    ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	   //КонецЕсли;
	   
	   
	   ОбластьСтрока.Параметры.Заполнить(Выборка);
	   ОбластьСтрока.Параметры.ПредставлениеПП = "ПП №"+ Прав(Выборка.ПлатежноеПоручение.Номер,6) + " от " + Формат(Выборка.ПлатежноеПоручение.Дата,"ДФ=dd.MM.yyyy; ДЛФ=D");
	   ИтогоСуммаПлатежа = ИтогоСуммаПлатежа + Выборка.СуммаПлатежа;
	   ТабДок.Вывести(ОбластьСтрока);
   КонецЦикла;

   Подвал = Макет.ПолучитьОбласть("Подвал");
   Подвал.Параметры.ИтогоСуммаПлатежа = ИтогоСуммаПлатежа;
   ТабДок.Вывести(Подвал);
   
//   ВставлятьРазделительСтраниц = Истина;
   
КонецПроцедуры 

Процедура ПечатьРеестраПени(ТабДок, Ссылка) Экспорт
   Макет = Документы.ЛаРС_РеестрОплатыИсков.ПолучитьМакет("ПФ_MXL_РеестрОплатыПени");
   Запрос = Новый Запрос;
   Запрос.Текст = "ВЫБРАТЬ
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.Ссылка КАК Ссылка,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.НомерСтроки КАК НомерСтроки,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.ФИО КАК ФИО,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.Адрес КАК Адрес,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.СуммаПени КАК СуммаПени,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.ПлатежноеПоручение КАК ПлатежноеПоручение,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.ПериодЗадолженности КАК ПериодЗадолженности
                  |ИЗ
                  |	Документ.ЛаРС_РеестрОплатыИсков.ТаблицаОплат КАК ЛаРС_РеестрОплатыИсковТаблицаОплат
                  |ГДЕ
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.Ссылка = &Ссылка
                  |	И ЛаРС_РеестрОплатыИсковТаблицаОплат.СуммаПени > 0"; //сам текст запроса нам не принципиален
   Запрос.Параметры.Вставить("Ссылка", Ссылка); //в качестве параметра указываем Ссылку – параметр процедуры
   Выборка = Запрос.Выполнить().Выбрать();

   Шапка = Макет.ПолучитьОбласть("Шапка");
   Шапка.Параметры.Заполнить(Ссылка);
   ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
   ТабДок.Очистить();

   ВставлятьРазделительСтраниц = Ложь;
   Шапка.Параметры.Заполнить(Выборка);
   ТабДок.Вывести(Шапка);
   
   ИтогоСуммаПлатежа = 0;
   Пока Выборка.Следующий() Цикл
	   //Если ВставлятьРазделительСтраниц Тогда
	   //    ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	   //КонецЕсли;
	   
	   
	   ОбластьСтрока.Параметры.Заполнить(Выборка);
	   ОбластьСтрока.Параметры.ПредставлениеПП = "ПП №"+ Прав(Выборка.ПлатежноеПоручение.Номер,6) + " от " + Формат(Выборка.ПлатежноеПоручение.Дата,"ДФ=dd.MM.yyyy; ДЛФ=D");
	   ИтогоСуммаПлатежа = ИтогоСуммаПлатежа + Выборка.СуммаПени;
	   ТабДок.Вывести(ОбластьСтрока);
   КонецЦикла;

   Подвал = Макет.ПолучитьОбласть("Подвал");
   Подвал.Параметры.ИтогоСуммаПлатежа = ИтогоСуммаПлатежа;
   ТабДок.Вывести(Подвал);
   
//   ВставлятьРазделительСтраниц = Истина;
   
КонецПроцедуры