
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЛаРС_ОплатаИсков Приход
	Движения.ЛаРС_ОплатаИсков.Записывать = Истина;
	Движение = Движения.ЛаРС_ОплатаИсков.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Иск = Иск;
	Движение.Сумма = СуммаИска;
	Движение.Пени = Пени;
	Движение.Госпошлина = Госпошлина;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если (Не Документы.ЛаРС_ВводЗадолженностиПоИску.НайтиПоРеквизиту("Иск", ЭтотОбъект.Иск) = Документы.ЛаРС_ВводЗадолженностиПоИску.ПустаяСсылка()) и ЭтотОбъект.ЭтоНовый() Тогда
		Сообщить(СтрШаблон("В базе данных есть ввод остатков по иску с номером судебного решения %1, не возможно ввести несколько документов ввода остатков по одному и тому же иску.", ЭтотОбъект.Иск.НомерСудебногоРешения));
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
