&НаКлиенте
Процедура ВыборПериода(Команда)
	
	Диалог 					= Новый ДиалогРедактированияСтандартногоПериода();                                 
	Диалог.Период 				= Новый СтандартныйПериод(Объект.ПериодС, Объект.ПериодПо);        
	ОписаниеОповещенияОЗакрытииФормы 	= Новый ОписаниеОповещения("ВыполнитьПослеВыбораПериода", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещенияОЗакрытииФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораПериода(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Объект.ПериодС 	= Результат.ДатаНачала;
       	Объект.ПериодПо 	= Результат.ДатаОкончания;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеНаРасчетныйСчет.ЛаРС_Иск КАК ЛаРС_Иск,
	               |	СУММА(ПоступлениеНаРасчетныйСчет.СуммаДокумента) КАК СуммаДокумента,
	               |	МАКСИМУМ(ПоступлениеНаРасчетныйСчет.Ссылка) КАК Ссылка
	               |ПОМЕСТИТЬ ОплатаПоИскам
	               |ИЗ
	               |	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	               |ГДЕ
	               |	ПоступлениеНаРасчетныйСчет.ЛаРС_Иск <> ЗНАЧЕНИЕ(Справочник.ЛаРС_Иски.ПустаяСсылка)
	               |	И ПоступлениеНаРасчетныйСчет.Дата МЕЖДУ &ПериодС И &ПериодПо
	               |	И ПоступлениеНаРасчетныйСчет.Организация = &Организация
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеНаРасчетныйСчет.ЛаРС_Иск
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОплатаПоИскам.ЛаРС_Иск КАК Иск,
	               |	ЛаРС_ОплатаИсковОстатки.СуммаОстаток КАК ДолгОстаток,
	               |	ЛаРС_ОплатаИсковОстатки.ПениОстаток КАК ПениОстаток,
	               |	ЛаРС_ОплатаИсковОстатки.ГоспошлинаОстаток КАК ГоспошлинаОстаток,
	               |	ОплатаПоИскам.ЛаРС_Иск.АдресСтрокой КАК Адрес,
	               |	ОплатаПоИскам.ЛаРС_Иск.Ответчик КАК ФИО,
	               |	ОплатаПоИскам.ЛаРС_Иск.ПериодЗадолженности КАК ПериодЗадолженности,
	               |	ОплатаПоИскам.СуммаДокумента КАК СуммаПлатежа,
	               |	ОплатаПоИскам.Ссылка КАК ПлатежноеПоручение
	               |ИЗ
	               |	ОплатаПоИскам КАК ОплатаПоИскам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛаРС_ОплатаИсков.Остатки КАК ЛаРС_ОплатаИсковОстатки
	               |		ПО ОплатаПоИскам.ЛаРС_Иск = ЛаРС_ОплатаИсковОстатки.Иск";
	Запрос.УстановитьПараметр("ПериодС", НачалоДня(Объект.ПериодС));
	Запрос.УстановитьПараметр("ПериодПо", КонецДня(Объект.ПериодПо)); 
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Результат = Запрос.Выполнить().Выгрузить();
	Объект.ТаблицаОплат.Загрузить(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура РаспределитьОплатуНаСервере()

	Для каждого Стр Из Объект.ТаблицаОплат Цикл
		
		ОплатаГоспошлины = Мин(Стр.СуммаПлатежа, Стр.ГоспошлинаОстаток);
		ОплатаДолга = Мин(Стр.СуммаПлатежа - ОплатаГоспошлины, Стр.ДолгОстаток);
		ОплатаПени = Мин (Стр.СуммаПлатежа - ОплатаГоспошлины - ОплатаДолга, Стр.ПениОстаток);
        Стр.Госпошлина = ОплатаГоспошлины;
		Стр.Долг = ОплатаДолга;
		Стр.Пени = ОплатаПени;
		
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура РаспределитьОплату(Команда)
	РаспределитьОплатуНаСервере();
КонецПроцедуры

