

&После("ДобавитьКомандыПечати")
Процедура ЛаРС_ДобавитьКомандыПечати(КомандыПечати)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_СправкаВОтделСоцзащиты";
	КомандаПечати.Представление = "Справка в отдел соцзащиты";
	КомандаПечати.Обработчик    = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаЭлемента";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_СправкаВОтделСубсидии";
	КомандаПечати.Представление = "Справка в отдел субсидии";
	КомандаПечати.Обработчик    = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаЭлемента";
	
КонецПроцедуры

