Процедура ПечатьРеестра(ПараметрКоманды) Экспорт
   ТабДок = Новый ТабличныйДокумент;

   ЛаРС_НаСервере.Печать(ТабДок, ПараметрКоманды); //вызов серверного общего модуля Команды

   ТабДок.ОтображатьСетку = Ложь;
   ТабДок.Защита = Ложь;
   ТабДок.ТолькоПросмотр = Ложь;
   ТабДок.ОтображатьЗаголовки = Ложь;
   ТабДок.Показать();
КонецПроцедуры 

Процедура ПечатьРеестраПени(ПараметрКоманды) Экспорт
   ТабДок = Новый ТабличныйДокумент;

   ЛаРС_НаСервере.ПечатьРеестраПени(ТабДок, ПараметрКоманды); //вызов серверного общего модуля Команды

   ТабДок.ОтображатьСетку = Ложь;
   ТабДок.Защита = Ложь;
   ТабДок.ТолькоПросмотр = Ложь;
   ТабДок.ОтображатьЗаголовки = Ложь;
   ТабДок.Показать();
КонецПроцедуры