
&После("ОбработкаПроведения")
Процедура ЛаРС_ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЭтотОбъект.ЛаРС_ОтразитьВКУДиР Тогда
		
		НЗ = РегистрыНакопления.КнигаУчетаДоходовИРасходов.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
		
		Для каждого Движ Из Движения.Хозрасчетный Цикл
			Зап = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(Зап, Движ);
			Зап.Контрагент = Движ.СубконтоКт.Контрагенты;
			Зап.ДоговорКонтрагента = Движ.СубконтоКт.Договоры;
			Зап.Регистратор = ЭтотОбъект.Ссылка;
			Зап.Содержание = "Оплата за ЖКУ от населения";
			Зап.РеквизитыПервичногоДокумента = Формат(Зап.Регистратор.Дата, "ДФ=dd.MM.yyyy") + ", " + "№ " + Формат(Зап.Регистратор.Номер, "ЧДЦ=0; ЧГ=0");
			Если Движ.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.09") Тогда
				Зап.Содержание = "Оплата за ЖКУ от населения";
				Зап.Графа4 = Движ.Сумма;
				Зап.Графа5 = Движ.Сумма;
			Иначе
				Зап.Содержание = Зап.Регистратор.Комментарий;
				Зап.Графа6 = Движ.Сумма;
				Зап.Графа7 = Движ.Сумма;
			КонецЕсли;
			
		КонецЦикла;
		НЗ.Записать();
		ЭтотОбъект.РучнаяКорректировка = Истина;
	КонецЕсли;
	
КонецПроцедуры
