
&НаСервере
Процедура ИскПриИзмененииНаСервере()

	Объект.СуммаИска = Объект.Иск.СуммаИска;
	Объект.Госпошлина = Объект.Иск.Госпошлина;
	Объект.Пени = Объект.Иск.Пени;

КонецПроцедуры

&НаКлиенте
Процедура ИскПриИзменении(Элемент)
	ИскПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка
	Основание = ЭтотОбъект.Параметры.ЗначенияЗаполнения;
	Если ТипЗнч(Основание.Основание) = Тип("СправочникСсылка.ЛаРС_Иски") Тогда
		Объект.СуммаИска = Основание.Основание.СуммаИска;
		Объект.Госпошлина = Основание.Основание.Госпошлина;
		Объект.Пени = Основание.Основание.Пени;
		Объект.Иск = Основание.Основание;
	КонецЕсли;
Исключение
	КонецПопытки;
		
КонецПроцедуры
