
&НаКлиенте
Процедура УстановитьДатаНомерСудебногоРешенияПриИзменении()
	//ЭтаФорма.Объект.Наименование=СокрЛП(ЭтаФорма.Элементы.НомерСудебногоРешения.ТекстРедактирования)
	//+" от "+Формат(Элементы.ДатаСудебногоРешения.ТекстРедактирования)
	//+" "+Формат(Элементы.Ответчик.ТекстРедактирования)
	//;
	
	Объект.Наименование=СокрЛП(Объект.НомерСудебногоРешения)
	+" от "+Формат(Объект.ДатаСудебногоРешения,"ДФ=dd.MM.yyyy")
	+" "+СокрЛП(Объект.Ответчик);
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаСудебногоРешенияПриИзменении(Элемент)
	УстановитьДатаНомерСудебногоРешенияПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура НомерСудебногоРешенияПриИзменении(Элемент)
	УстановитьДатаНомерСудебногоРешенияПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ОтветчикПриИзменении(Элемент)
	УстановитьДатаНомерСудебногоРешенияПриИзменении();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.Квартира) Тогда
		Объект.Адрес=СокрЛП(Объект.Квартира.Дом.Улица.Наименование)
		+" д."	+СокрЛП(Объект.Квартира.Дом.НомерДома)
		+" кв." +СокрЛП(Объект.Квартира.Номер);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УлицаПриИзмененииНаСервере()

	Объект.АдресСтрокой = "" + Объект.Улица + ", д." + Объект.Дом + ", кв." + Объект.Квартира;

КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	УлицаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьВводОстатковПоИскуНаСервере()

	Сообщить("Записали");
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВводОстатковПоИску(Команда)
	ЗадатьВопросОЗаписи();
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОЗаписи()

	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос",
	ЭтотОбъект); // Прописываем название процедуры-обработчика.
	
	ПоказатьВопрос(Оповещение, "Перед вводом документа ввода остатков необходимо записать элемент. Записать?",  // вместо привычного "Вопрос", теперь "ПоказатьВопрос"
	РежимДиалогаВопрос.ДаНетОтмена,
	0,  // задержка (секунды). необязательно
	КодВозвратаДиалога.Да, // задает кнопку по умолчанию. необязательно
	"Предупреждение о необходимости записи элемента справочника." // устанавливаем заголовок. необязательно
);

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт// здесь, думаю, комментировать нечего
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Записать();
		СтрДанные = Новый Структура("Основание", Объект.Ссылка);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", СтрДанные);
		ОткрытьФорму("Документ.ЛаРС_ВводЗадолженностиПоИску.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры
