
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЛаРС_ОплатаИсков Расход
	Движения.ЛаРС_ОплатаИсков.Записывать = Истина;
	Для Каждого ТекСтрокаТаблицаОплат Из ТаблицаОплат Цикл
		Движение = Движения.ЛаРС_ОплатаИсков.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ТекСтрокаТаблицаОплат.ПлатежноеПоручение.Дата;
		Движение.Иск = ТекСтрокаТаблицаОплат.Иск;
		Движение.ПлатежноеПоручение = ТекСтрокаТаблицаОплат.ПлатежноеПоручение;
		Движение.Сумма = ТекСтрокаТаблицаОплат.Долг;
		Движение.Пени = ТекСтрокаТаблицаОплат.Пени;
		Движение.Госпошлина = ТекСтрокаТаблицаОплат.Госпошлина;
	КонецЦикла;

	Движения.Хозрасчетный.Записывать = Истина;
	Для Каждого ТекСтрокаТаблицаОплат Из ТаблицаОплат Цикл
		Если ТекСтрокаТаблицаОплат.СуммаПлатежа > 0 Тогда
			Проводка = Движения.Хозрасчетный.Добавить();
			
			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			
			Проводка.Содержание  = СтрШаблон("ПП № %1 от %2", ТекСтрокаТаблицаОплат.ПлатежноеПоручение.Номер, Формат(ТекСтрокаТаблицаОплат.ПлатежноеПоручение.Дата,"ДФ=dd.MM.yyyy; ДЛФ=D"));//СокрЛП("тут будет содержание проводки");
			
			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", КонтрагентДт);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", ДоговорКонтрагентаДт);
			
			Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
			
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", КонтрагентКт);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", ДоговорКонтрагентаКт);
			
			Проводка.Сумма = ТекСтрокаТаблицаОплат.Долг;
		КонецЕсли;
		Если ТекСтрокаТаблицаОплат.Госпошлина > 0 Тогда
			Проводка = Движения.Хозрасчетный.Добавить();
			
			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			
			Проводка.Содержание  = СтрШаблон("ПП № %1 от %2", ТекСтрокаТаблицаОплат.ПлатежноеПоручение.Номер, Формат(ТекСтрокаТаблицаОплат.ПлатежноеПоручение.Дата,"ДФ=dd.MM.yyyy; ДЛФ=D"));//СокрЛП("тут будет содержание проводки");
			
			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", КонтрагентДт);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", ДоговорКонтрагентаДт);
			
			Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ПрочиеДоходы;
			
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", КонтрагентКт);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ПрочиеДоходыИРасходы", Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Госпошлина"));
			
			Проводка.Сумма = ТекСтрокаТаблицаОплат.Госпошлина;
		КонецЕсли;   
		Если ТекСтрокаТаблицаОплат.Пени > 0 Тогда
			Проводка = Движения.Хозрасчетный.Добавить();
			
			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			
			Проводка.Содержание  = СтрШаблон("ПП № %1 от %2", ТекСтрокаТаблицаОплат.ПлатежноеПоручение.Номер, Формат(ТекСтрокаТаблицаОплат.ПлатежноеПоручение.Дата,"ДФ=dd.MM.yyyy; ДЛФ=D"));//СокрЛП("тут будет содержание проводки");
			
			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", КонтрагентДт);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", ДоговорКонтрагентаДт);
			
			Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
			
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", КонтрагентКт);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", ДоговорКонтрагентаКт);
			
			Проводка.Сумма = ТекСтрокаТаблицаОплат.Пени;
	     КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
                                