
&После("ОбработкаПроведения")
Процедура ЛаРС_ОбработкаПроведения(Отказ, Режим)
	Если ЭтотОбъект.ЛаРС_ЧерезАгента Тогда
		ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ЭтотОбъект.ЛаРС_СчетУчетаАгент);
		Движения.Хозрасчетный.Записывать = Истина;
		ТаблицаДвижений = Движения.Хозрасчетный.Выгрузить();
		Для каждого Движ Из ТаблицаДвижений Цикл  		
			Если Движ.СчетКт = ЭтотОбъект.СчетБанк Тогда
				Движ.СчетКт = ЭтотОбъект.ЛаРС_СчетУчетаАгент;
				Движ.ВидСубконтоКт1 = ДанныеСчета.ВидСубконто1;
				Движ.СубконтоКт1 = ЭтотОбъект.ЛаРС_Субконто1А;
				Движ.ВидСубконтоКт2 = ДанныеСчета.ВидСубконто2;
				Движ.СубконтоКт2 = ЭтотОбъект.ЛаРС_Субконто2А;
				Движ.ВидСубконтоКт3 = ДанныеСчета.ВидСубконто3;
				Движ.СубконтоКт3 = ЭтотОбъект.ЛаРС_Субконто3А;
			КонецЕсли;
		КонецЦикла;
		Движения.Хозрасчетный.Загрузить(ТаблицаДвижений);
		//ЭтотОбъект.РучнаяКорректировка = Истина;
		Движения.Записать();
	КонецЕсли;
КонецПроцедуры
