
&НаКлиенте
Процедура ЛаРС_ЛаРС_СчетУчетаАгентПриИзмененииПосле(Элемент)
	
	ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ЭтаФорма.Объект.ЛаРС_СчетУчетаАгент);
    ПоляФормы = Новый Структура("Субконто1,Субконто2,Субконто3");
    ПоляФормы.Субконто1 = "ЛаРС_Субконто1А";
    ПоляФормы.Субконто2 = "ЛаРС_Субконто2А";
    ПоляФормы.Субконто3 = "ЛаРС_Субконто3А";
	
	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(ЭтаФорма.Объект.ЛаРС_СчетУчетаАгент, ЭтаФорма, ПоляФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура ЛаРС_ЛаРС_ЧерезАгентаПриИзмененииПосле(Элемент)
	
	Если ЭтаФорма.Объект.ЛаРС_ЧерезАгента Тогда
		ЭтаФорма.Элементы.ГруппаАгент.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.ГруппаАгент.Видимость = Ложь;
	КонецЕсли;
		 
	
КонецПроцедуры

&НаСервере
Процедура ЛаРС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Не ЭтаФорма.Объект.ЛаРС_СчетУчетаАгент = ПланыСчетов.Хозрасчетный.ПустаяСсылка() Тогда
		ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ЭтаФорма.Объект.ЛаРС_СчетУчетаАгент);
		ПоляФормы = Новый Структура("Субконто1,Субконто2,Субконто3");
		ПоляФормы.Субконто1 = "ЛаРС_Субконто1А";
		ПоляФормы.Субконто2 = "ЛаРС_Субконто2А";
		ПоляФормы.Субконто3 = "ЛаРС_Субконто3А";
		
		БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(ЭтаФорма.Объект.ЛаРС_СчетУчетаАгент, ЭтаФорма, ПоляФормы);
	КонецЕсли;

КонецПроцедуры
