
&НаКлиенте
Процедура ВыборПериода(Команда)
	
	Диалог 					= Новый ДиалогРедактированияСтандартногоПериода();                                 
	Диалог.Период 				= Новый СтандартныйПериод(Объект.ПериодС, Объект.ПериодПо);        
	ОписаниеОповещенияОЗакрытииФормы 	= Новый ОписаниеОповещения("ВыполнитьПослеВыбораПериода", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещенияОЗакрытииФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораПериода(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Объект.ПериодС 	= Результат.ДатаНачала;
       	Объект.ПериодПо 	= Результат.ДатаОкончания;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛаРС_ОплатаИсковОстаткиИОбороты.Иск КАК ЛаРС_Иск,
	               |	ЛаРС_ОплатаИсковОстаткиИОбороты.ПлатежноеПоручение КАК ПлатежноеПоручение,
	               |	ЛаРС_ОплатаИсковОстаткиИОбороты.СуммаРасход КАК СуммаПлатежа,
	               |	ЛаРС_ОплатаИсковОстаткиИОбороты.ПениРасход КАК СуммаПени,
	               |	ЛаРС_ОплатаИсковОстаткиИОбороты.Иск.Ответчик КАК ФИО,
	               |	ЛаРС_ОплатаИсковОстаткиИОбороты.Иск.ПериодЗадолженности КАК ПериодЗадолженности,
	               |	ЛаРС_ОплатаИсковОстаткиИОбороты.Иск.АдресСтрокой КАК Адрес
	               |ИЗ
	               |	РегистрНакопления.ЛаРС_ОплатаИсков.ОстаткиИОбороты(&ПериодС, &ПериодПо, , , ) КАК ЛаРС_ОплатаИсковОстаткиИОбороты";
	Запрос.УстановитьПараметр("ПериодС", НачалоДня(Объект.ПериодС));
	Запрос.УстановитьПараметр("ПериодПо", КонецДня(Объект.ПериодПо)); 
	//Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Результат = Запрос.Выполнить().Выгрузить();
	Объект.ТаблицаОплат.Загрузить(Результат);
	
КонецПроцедуры


&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПечатьРеестраНаСервере()

	

КонецПроцедуры


&НаКлиенте
Процедура ПечатьРеестра(Команда)
	ПечатьРеестраНаСервере();
КонецПроцедуры

